---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewGraphSunPath
source: html/f70dc5c5-e27a-7882-0a50-ab841ee31895.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewGraphSunPath Property

"Sun Path"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewGraphSunPath { get; }
```